lukasnee/m8ec/firmware/Middlewares/ST/STM32_USB_Host_Library/Core/Src/usbh_core.c
/**
  ******************************************************************************
  * @file    usbh_core.c
  * @author  MCD Application Team
  * @brief   This file implements the functions for the core state machine process
  *          the enumeration and the control transfer process
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2015 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                      www.st.com/SLA0044
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "usbh_core.h"


/** @addtogroup USBH_LIB
  * @{
  */

/** @addtogroup USBH_LIB_CORE
  * @{
  */

/** @defgroup USBH_CORE
  * @brief This file handles the basic enumeration when a device is connected
  *          to the host.
  * @{
  */


/** @defgroup USBH_CORE_Private_Defines
  * @{
  */
#define USBH_ADDRESS_DEFAULT                     0x00U
#define USBH_ADDRESS_ASSIGNED                    0x01U
#define USBH_MPS_DEFAULT                         0x40U
/**
  * @}
  */

/** @defgroup USBH_CORE_Private_Macros
  * @{
  */
/**
  * @}
  */


/** @defgroup USBH_CORE_Private_Variables
  * @{
  */
#if (USBH_USE_OS == 1U)
#if (osCMSIS >= 0x20000U)
osThreadAttr_t USBH_Thread_Atrr;
#endif
#endif


/**
  * @}
  */


/** @defgroup USBH_CORE_Private_Functions
  * @{
  */
static USBH_StatusTypeDef USBH_HandleEnum(USBH_HandleTypeDef *phost);
static void USBH_HandleSof(USBH_HandleTypeDef *phost);
static USBH_StatusTypeDef DeInitStateMachine(USBH_HandleTypeDef *phost);

#if (USBH_USE_OS == 1U)
#if (osCMSIS < 0x20000U)
static void USBH_Process_OS(void const *argument);
#else
static void USBH_Process_OS(void *argument);
#endif
#endif

void USBH_ResetActiveClasses(USBH_HandleTypeDef *phost) {
  phost->pActiveClass = NULL;
  for (uint8_t i = 0U; i < USBH_MAX_NUM_ACTIVE_CLASSES; i++) {
    phost->ActiveIfaceCtrl.ifaces[i].descIdx = 0U;
    phost->ActiveIfaceCtrl.ifaces[i].pClass = NULL;
  }
  phost->ActiveIfaceCtrl.number = 0U;
  phost->ActiveIfaceCtrl.nextMinIdx = 0U;
  phost->ActiveIfaceCtrl.nextMaxIdx = 0U;
  phost->ActiveIfaceCtrl.currIdx = 0U;
}

USBH_ClassTypeDef *USBH_ResolveSupportedClassForIface(USBH_HandleTypeDef *phost, uint8_t itfDescIdx) {
  const uint8_t bInterfaceClass = phost->device.CfgDesc.Itf_Desc[itfDescIdx].bInterfaceClass;
  for (uint8_t i = 0U; i < phost->ClassNumber; i++) {
    if (phost->pClass[i]->ClassCode == bInterfaceClass) {
      return phost->pClass[i];
    }
  }
  USBH_ErrLog("Class %02Xh not supported", bInterfaceClass);
  return NULL;
}

uint8_t USBH_RegisterActiveClassIfacePair(USBH_HandleTypeDef *phost, uint8_t ifaceDescrIdx, USBH_ClassTypeDef *pClass) {
  if (phost->ActiveIfaceCtrl.number >= USBH_MAX_NUM_ACTIVE_CLASSES) {
    USBH_ErrLog("Max number of active classes reached");
    return 0;
  }
  phost->ActiveIfaceCtrl.ifaces[phost->ActiveIfaceCtrl.number].descIdx = ifaceDescrIdx;
  phost->ActiveIfaceCtrl.ifaces[phost->ActiveIfaceCtrl.number].pClass = pClass;
  USBH_UsrLog("Registered class: %02Xh", pClass->ClassCode);
  USBH_DbgLog("\n"
              "\tbInterfaceNumber: %d\n"
              "\tbAlternateSetting: %d\n"
              "\tbNumEndpoints: %d\n"
              "\tbInterfaceClass: %02Xh\n"
              "\tbInterfaceSubClass: %02Xh\n"
              "\tbInterfaceProtocol: %02Xh\n"
              "\tiInterface: %d\n",
              phost->device.CfgDesc.Itf_Desc[ifaceDescrIdx].bInterfaceNumber,
              phost->device.CfgDesc.Itf_Desc[ifaceDescrIdx].bAlternateSetting,
              phost->device.CfgDesc.Itf_Desc[ifaceDescrIdx].bNumEndpoints,
              phost->device.CfgDesc.Itf_Desc[ifaceDescrIdx].bInterfaceClass,
              phost->device.CfgDesc.Itf_Desc[ifaceDescrIdx].bInterfaceSubClass,
              phost->device.CfgDesc.Itf_Desc[ifaceDescrIdx].bInterfaceProtocol,
              phost->device.CfgDesc.Itf_Desc[ifaceDescrIdx].iInterface);
  phost->ActiveIfaceCtrl.number++;
  phost->ActiveIfaceCtrl.nextMaxIdx = phost->ActiveIfaceCtrl.number;
  return 1;
}

uint8_t USBH_SwitchActiveIfaceClass(USBH_HandleTypeDef *phost, const uint8_t ifaceIdx) {
  if (ifaceIdx >= phost->ActiveIfaceCtrl.number) {
    return 0;
  }
  phost->ActiveIfaceCtrl.currIdx = ifaceIdx;
  phost->pActiveClass = phost->ActiveIfaceCtrl.ifaces[phost->ActiveIfaceCtrl.currIdx].pClass;
  phost->device.current_interface = phost->ActiveIfaceCtrl.ifaces[phost->ActiveIfaceCtrl.currIdx].descIdx;
  USBH_TrcLog("Switched to interface #%d", phost->ActiveIfaceCtrl.currIdx);
  return 1;
}

uint8_t USBH_RegisterIfaceClasses(USBH_HandleTypeDef *phost) {
  if (phost->ActiveIfaceCtrl.number != 0) {
    return phost->ActiveIfaceCtrl.number;
  }
  USBH_ResetActiveClasses(phost);
  USBH_DbgLog("bNumInterfaces: %d", phost->device.CfgDesc.bNumInterfaces);
  for (uint8_t ifaceDescrIdx = 0U; ifaceDescrIdx < phost->device.CfgDesc.bNumInterfaces; ifaceDescrIdx++) {
    USBH_ClassTypeDef *pClass = USBH_ResolveSupportedClassForIface(phost, ifaceDescrIdx);
    if (!pClass) {
      continue;
    }
    if (!USBH_RegisterActiveClassIfacePair(phost, ifaceDescrIdx, pClass)) {
      break;
    }
  }
  USBH_SwitchActiveIfaceClass(phost, phost->ActiveIfaceCtrl.nextMinIdx);
  return phost->ActiveIfaceCtrl.number;
}

uint8_t USBH_SwitchActiveIfaceClassNext(USBH_HandleTypeDef *phost) {
  if (phost->ActiveIfaceCtrl.currIdx + 1 > phost->ActiveIfaceCtrl.nextMaxIdx) {
    USBH_SwitchActiveIfaceClass(phost, phost->ActiveIfaceCtrl.nextMinIdx);
    return 0;
  }
  return USBH_SwitchActiveIfaceClass(phost, phost->ActiveIfaceCtrl.currIdx + 1);
}

uint8_t USBH_GetActiveIfaceClassIdx(USBH_HandleTypeDef *phost) { return phost->ActiveIfaceCtrl.currIdx; }

/**
 * @brief  HCD_Init
 *         Initialize the HOST Core.
 * @param  phost: Host Handle
 * @param  pUsrFunc: User Callback
 * @retval USBH Status
 */
USBH_StatusTypeDef  USBH_Init(USBH_HandleTypeDef *phost,
                              void (*pUsrFunc)(USBH_HandleTypeDef *phost,
                              uint8_t id), uint8_t id)
{
  /* Check whether the USB Host handle is valid */
  if (phost == NULL)
  {
    USBH_ErrLog("Invalid Host handle");
    return USBH_FAIL;
  }

  /* Set DRiver ID */
  phost->id = id;

  /* Unlink class*/
  USBH_ResetActiveClasses(phost);
  phost->ClassNumber = 0U;

  /* Restore default states and prepare EP0 */
  DeInitStateMachine(phost);

