lukasnee/m8ec/firmware/Middlewares/ST/STM32_USB_Host_Library/Core/Src/usbh_core.c
        if (phost->device.DevDesc.bNumConfigurations == 1U)
        {
          USBH_UsrLog("This device has only 1 configuration.");
          phost->gState = HOST_SET_CONFIGURATION;
        }
        else
        {
          phost->gState = HOST_INPUT;
        }
#if (USBH_USE_OS == 1U)
        phost->os_msg = (uint32_t)USBH_STATE_CHANGED_EVENT;
#if (osCMSIS < 0x20000U)
        (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
        (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0);
#endif
#endif
      }
      break;

    case HOST_INPUT:
    {
      /* user callback for end of device basic enumeration */
      if (phost->pUser != NULL)
      {
        phost->pUser(phost, HOST_USER_SELECT_CONFIGURATION);
        phost->gState = HOST_SET_CONFIGURATION;

#if (USBH_USE_OS == 1U)
        phost->os_msg = (uint32_t)USBH_STATE_CHANGED_EVENT;
#if (osCMSIS < 0x20000U)
        (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
        (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0);
#endif
#endif
      }
    }
    break;

    case HOST_SET_CONFIGURATION:
      /* set configuration */
      if (USBH_SetCfg(phost, (uint16_t)phost->device.CfgDesc.bConfigurationValue) == USBH_OK)
      {
        phost->gState = HOST_SET_WAKEUP_FEATURE;
        USBH_UsrLog("Default configuration set.");
      }

#if (USBH_USE_OS == 1U)
      phost->os_msg = (uint32_t)USBH_PORT_EVENT;
#if (osCMSIS < 0x20000U)
      (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
      (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0);
#endif
#endif
      break;

    case  HOST_SET_WAKEUP_FEATURE:

      if ((phost->device.CfgDesc.bmAttributes) & (1U << 5))
      {
        if (USBH_SetFeature(phost, FEATURE_SELECTOR_REMOTEWAKEUP) == USBH_OK)
        {
          USBH_UsrLog("Device remote wakeup enabled");
          phost->gState = HOST_CHECK_CLASS;
        }
      }
      else
      {
        phost->gState = HOST_CHECK_CLASS;
      }

#if (USBH_USE_OS == 1U)
      phost->os_msg = (uint32_t)USBH_PORT_EVENT;
#if (osCMSIS < 0x20000U)
      (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
      (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0);
#endif
#endif
      break;

    case HOST_CHECK_CLASS:

      if (phost->ClassNumber == 0U) {
        USBH_UsrLog("No Class has been registered.");
      }
      else {
        if (0 == USBH_RegisterIfaceClasses(phost)) {
          phost->gState = HOST_ABORT_STATE;
          USBH_UsrLog("No registered class for this device.");
        }
        else {
          phost->ActiveIfaceCtrl.nextMinIdx = 0U; // TODO remove limitation, select it fro user space (APP?)
          phost->ActiveIfaceCtrl.nextMaxIdx = 1U; // TODO remove limitation, select it fro user space (APP?)
          if (phost->pActiveClass->Init(phost) != USBH_OK) {
            phost->gState = HOST_ABORT_STATE;
            USBH_UsrLog("Device not supporting %s class.", phost->pActiveClass->Name);
          }
          else {
            USBH_UsrLog("%s class started.", phost->pActiveClass->Name);
            /* Inform user that a class has been activated */
            phost->pUser(phost, HOST_USER_CLASS_SELECTED);
            if (0 == USBH_SwitchActiveIfaceClassNext(phost)) {
              phost->gState = HOST_CLASS_REQUEST;
              phost->Timeout = 0U;
            }
          }
        }
      }

#if (USBH_USE_OS == 1U)
      phost->os_msg = (uint32_t)USBH_STATE_CHANGED_EVENT;
#if (osCMSIS < 0x20000U)
      (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
      (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0);
#endif
#endif
      break;

    case HOST_CLASS_REQUEST: {
      /* process class standard control requests state machine */
      if (!phost->pActiveClass) {
        phost->gState = HOST_ABORT_STATE;
        USBH_ErrLog("Invalid Class Driver. activeIfaceClassIdx=%u", USBH_GetActiveIfaceClassIdx(phost));
      }
      else {
        status = phost->pActiveClass->Requests(phost);
        if (status != USBH_OK) {
          USBH_TrcLog("Device not responding, try replugging. activeIfaceClassIdx=%u, status: %s",
                      USBH_GetActiveIfaceClassIdx(phost), USBH_STATUS_STRINGS[status]);
          phost->Timeout++;
          if (phost->Timeout >= 500U) {
            USBH_DbgLog("phost->Timeout reached for interface %u", USBH_GetActiveIfaceClassIdx(phost));
            phost->Timeout = 0U;
            if (0 == USBH_SwitchActiveIfaceClassNext(phost)) {
              phost->gState = HOST_CLASS;
            }
          }
        }
        else if (status == USBH_FAIL) {
          phost->gState = HOST_ABORT_STATE;
          USBH_ErrLog("Device not responding Please Unplug.");
        }
        else {
          if (0 == USBH_SwitchActiveIfaceClassNext(phost)) {
            phost->gState = HOST_CLASS;
          }
        }
      }
#if (USBH_USE_OS == 1U)
      phost->os_msg = (uint32_t)USBH_STATE_CHANGED_EVENT;
#if (osCMSIS < 0x20000U)
      (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
      (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0);
#endif
#endif
      break;
    }

    case HOST_CLASS: {
      /* process class state machine */
      if (phost->pActiveClass != NULL) {
        // TODO figure out when it's good time time switch interface and to which one. According to os_msg? more specific case
        // probably.
        if (phost->os_msg == USBH_URB_EVENT) {
          // THIS IS A WORKING HACK not sure how well it works actually
          USBH_SwitchActiveIfaceClassNext(phost);
        }
        phost->pActiveClass->BgndProcess(phost);
      }
      break;
    }
    case HOST_DEV_DISCONNECTED :
      phost->device.is_disconnected = 0U;

      DeInitStateMachine(phost);

      /* Re-Initilaize Host for new Enumeration */
      if (phost->pActiveClass != NULL)
      {
        phost->pActiveClass->DeInit(phost);
        USBH_ResetActiveClasses(phost);
        phost->pActiveClass = NULL;
      }

      if (phost->pUser != NULL)
      {
        phost->pUser(phost, HOST_USER_DISCONNECTION);
      }
      USBH_UsrLog("USB Device disconnected");

      if (phost->device.is_ReEnumerated == 1U)
      {
        phost->device.is_ReEnumerated = 0U;

        /* Start the host and re-enable Vbus */
        USBH_Start(phost);
      }
      else
      {
        /* Device Disconnection Completed, start USB Driver */
        USBH_LL_Start(phost);
      }

#if (USBH_USE_OS == 1U)
      phost->os_msg = (uint32_t)USBH_PORT_EVENT;
#if (osCMSIS < 0x20000U)
      (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
      (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0);
#endif
#endif
      break;

    case HOST_ABORT_STATE:
    default :
      break;
  }
  return USBH_OK;
}


/**
  * @brief  USBH_HandleEnum
  *         This function includes the complete enumeration process
  * @param  phost: Host Handle
  * @retval USBH_Status
  */
static USBH_StatusTypeDef USBH_HandleEnum(USBH_HandleTypeDef *phost)
{
  USBH_StatusTypeDef Status = USBH_BUSY;
  USBH_StatusTypeDef ReqStatus = USBH_BUSY;

